Revit 2027 API
BuiltInFailures.AnalyticalAutomationFailures.DeleteGeneratedPlans Property
 You are about to change your selection. Updating your selection will delete the existing reference plans.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeleteGeneratedPlans { get; }
Public Shared ReadOnly Property DeleteGeneratedPlans As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeleteGeneratedPlans {
	FailureDefinitionId^ get ();
}
static member DeleteGeneratedPlans : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalAutomationFailures Class
Autodesk.Revit.DB Namespace